cf_billing/AccumulationRegisters/энргОбъемНачисленийПомещенийСРазделеннымиЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОбъемНачисленийПомещенийСРазделеннымиЛС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиСоцНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленныйСоцНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимаяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСоциальнойНормы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеТарифаСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЖильцов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПерерасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПерерасчетаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключатьВНеполивнойСезон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьМОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьСобственнаяПоставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовыщающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборЗависимой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоФормуле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СниматьНачисленныйСредний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьИзНормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСреднийПоВсемТочкамУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСписаниеНачислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонДифференцированногоТарифа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СверхНорматива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДокументыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДокументыНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчетМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацийНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОперацийНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/энргНачисления/Ext/Module.bsl
#Область СлужебныйИнтерфейс

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура Начислить(Параметры) Экспорт
	                                                                  
	Инструменты 								= энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	
	Делегат 									= энргФабрикаИнструментовНачисления.ДелегатНачислений();
	
	Если Делегат = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	
	Делегат.Организация  						= Параметры.Организация;
	Делегат.Район								= Параметры.Район;
	Делегат.ЧастныйСектор 						= Параметры.ЧастныйСектор;
	Делегат.Строение							= Параметры.Строение;
	Делегат.МассивПомещений						= Параметры.Помещение;
	Делегат.МассивКлючейПомещений				= Параметры.МассивКлючейПомещений;
	Делегат.ПериодНачисления					= Параметры.ПериодНачисления;
	Делегат.МенеджерОбъемаНачислений 			= РегистрыНакопления.энргОбъемНачислений;
	Делегат.МенеджерОбъемаНачисленийПомещений 	= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС;
	Делегат.МенеджерДокументовНачислений 		= Документы.энргНачисление;
	Делегат.ПроверятьДатуЗапретаИзменения 		= Истина;
	Делегат.ФинальноеНачисление 				= Параметры.ФинальноеНачисление;
	
	Инструменты.Начислить(Делегат);
	
КонецПроцедуры

// Процедура - Восстановить полседовательность
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура ВосстановитьПолседовательность(Организация, ПериодНачисления,Район,Строение = Неопределено,Помещение = Неопределено) Экспорт
	
	РаботаСПоследовательностями = энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если РаботаСПоследовательностями = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли;
	
	РаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисления(Организация, ПериодНачисления, Район, Строение);
	РаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды(Организация, ПериодНачисления, Район, Строение, Помещение);
	РаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУ(Организация, ПериодНачисления, Район, Строение, Помещение);
	
КонецПроцедуры

// Процедура - НачислитьЛьготы
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура НачислитьЛьготы(Параметры,Абонент = Неопределено,Документ  = Неопределено) Экспорт
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	Инструменты.НачислитьЛьготы(Параметры.Организация, Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД,Абонент,Документ);
	
КонецПроцедуры

// Процедура - Начисление на ОДН
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  ДокументОбъект	 - 	 - 
//
Процедура НачислениеНаОДН(Параметры, ДокументОбъект = Неопределено)  Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачисленийМКД();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.НачислениеНаОДН(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД, ДокументОбъект);
	
КонецПроцедуры

Процедура РаспредениеОбъемаМКД(Параметры, Документ = Неопределено)  Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.РаспредениеОбъемаМКД(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД, Документ);

КонецПроцедуры

// Процедура Начисление по формулам расчета
Процедура НачислитьПоФормуламРасчета(Организация, ПериодНачисления,Район,МКД = Неопределено,Абонент = Неопределено, Документ = Неопределено) Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	//Инструменты.НачислитьПоФормуламРасчета(Организация, ПериодНачисления,Район,МКД,Абонент, Документ);
	Инструменты.НачислениеПоДолевымСхемам(Организация, ПериодНачисления,Район,МКД,Абонент, Документ);
	
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  ЧастныйСектор	 -   -
//  Строение		 - 	 - 
//  Помещение		 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисления(Параметры, Документ  = Неопределено) Экспорт
		
	Инструменты 	= энргФабрикаИнструментовНачисления.ИнструментыПерерасчет();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	
	Делегат 						= Обработки.энргДелегатПерерасчетСреднихНачислений.Создать();
	Делегат.Организация 			= Параметры.Организация;
	Делегат.ПериодНачисления 		= Параметры.ПериодНачисления;
	Делегат.Район 					= Параметры.Район;
	Делегат.ЧастныйСектор 			= Параметры.ЧастныйСектор;
	Делегат.Строение 				= Параметры.Строение;
	Делегат.Помещение 				= Параметры.Помещение;
	Делегат.ФинальноеНачисление		= Параметры.ФинальноеНачисление;
	Делегат.МассивАбонентов 		= Параметры.МассивАбонентов;
	Делегат.МассивКлючейПомещений	= Параметры.МассивКлючейПомещений;
	
	Инструменты.СнятьСредниеНачисления(Делегат);

КонецПроцедуры

Процедура УстановитьЗначенияДифференцированныхТарифов(Параметры) Экспорт
	
	Инструменты = энргФабрикаИнструментовНачисления.СервисУстановкиЗначенийДифференцированныхТарифов();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	
	Инструменты.ПараметрыОперации.Организация 			= Параметры.Организация;
	Инструменты.ПараметрыОперации.ПериодНачисления 		= Параметры.ПериодНачисления;
	Инструменты.ПараметрыОперации.Район 				= Параметры.Район;
	Инструменты.ПараметрыОперации.ЧастныйСектор 		= Параметры.ЧастныйСектор;
	Инструменты.ПараметрыОперации.Строения 				= Параметры.Строение;
		
	Инструменты.ВыполнитьОперацию();
	
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисленияМКД(Параметры) Экспорт
		
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыПерерасчет();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.СнятьСредниеНачисленияМКД(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД);

КонецПроцедуры

Процедура ОтменитьЗакрытьПериода(Организация, ПериодНачисления,Район,МКД = Неопределено) Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ОтменитьЗакрытьПериода(Организация, ПериодНачисления,Район,МКД);
	
КонецПроцедуры

Процедура НачислениеПоРассрочке(Параметры, Документ  = Неопределено)  Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.НачислениеПоРассрочке(Параметры.Организация, Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД,Документ);
	
КонецПроцедуры

Процедура НачислитьПеню(Параметры, Абонент = Неопределено,Документ = Неопределено) Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачисленийПени();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	
	ВходныеПараметрыПени = Инструменты.НовыеВходныеПараметры();
	ЗаполнитьЗначенияСвойств(ВходныеПараметрыПени, Параметры);
	ВходныеПараметрыПени.Абонент = Абонент;
	ВходныеПараметрыПени.Документ = Документ;
	
	Инструменты.НачислитьПеню(ВходныеПараметрыПени); 
	
КонецПроцедуры

Процедура ЗакрытьПериодДляРедактирования(Параметры) Экспорт  
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ЗакрытьПериодДляРедактирования(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район);
	
КонецПроцедуры

Процедура ДанныеПерерасчета(Организация,Район,ЧастныйСектор,Строение,Помещения,ПериодНачисленияНачало,ПериодНачисленияЗавершение,Набор,НаборПомещение,КорректировкаПоказаний,ДополнительныеРеквизиты) Экспорт 
		
	Делегат 								= энргФабрикаИнструментовНачисления.ДелегатПерерасчета();
	Если Делегат = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	Инструмент 								= энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструмент = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	Делегат.Организация  					= Организация;
	Делегат.Район							= Район;
	Делегат.ЧастныйСектор 					= ЧастныйСектор;
	Делегат.Строение						= Строение;
	Делегат.мПомещения						= Помещения;
	Делегат.ПериодНачисленияНачало			= ПериодНачисленияНачало;
	Делегат.ПериодНачисленияЗавершение		= ПериодНачисленияЗавершение;
	Делегат.МенеджерДокументовНачислений	= Документы.энргПерерасчет;
	Делегат.ПроверятьДатуЗапретаИзменения 	= Ложь;

	//НаборПоказаний 							= РегистрыСведений.энргМаксимальныеПоказания.СоздатьНаборЗаписей();
	НаборПоказаний 							= РегистрыСведений.энргПоказанияПриборовУчета.СоздатьНаборЗаписей();

	Для Каждого СтрокаПоказаний Из КорректировкаПоказаний Цикл
		Если СтрокаПоказаний.СостояниеПоказанийПосле = Перечисления.энргСостояниеПоказаний.Отклонены Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНабора 						= НаборПоказаний.Добавить();
		СтрокаНабора.Период		 			= СтрокаПоказаний.Период;
		СтрокаНабора.Регистратор 			= СтрокаПоказаний.Регистратор;
		//СтрокаНабора.ДокРегистратор 		= СтрокаПоказаний.Регистратор; 		
		СтрокаНабора.Организация 			= Организация;
		СтрокаНабора.Район 					= Район;
		СтрокаНабора.КлючПомещения			= СтрокаПоказаний.КлючПомещения;
		СтрокаНабора.ПриборУчета 			= СтрокаПоказаний.ПриборУчета;
		СтрокаНабора.Шкала 					= СтрокаПоказаний.Шкала;
		СтрокаНабора.ТарифнаяЗона 			= СтрокаПоказаний.ТарифнаяЗона;
		СтрокаНабора.Разделитель 			= СтрокаПоказаний.Разделитель;
		СтрокаНабора.Показание 				= СтрокаПоказаний.Показания;
		СтрокаНабора.ПериодНачисления 		= СтрокаПоказаний.ПериодНачисления;
	КонецЦикла;
		
	ИсточникиДанных 						= Новый Структура;
	ИсточникиДанных.Вставить("НаборСтабильныеПериоды",			Неопределено);
	ИсточникиДанных.Вставить("НаборСтабильныеПериодыШкалы",		Неопределено);
	ИсточникиДанных.Вставить("НаборСтабильныеПериодыИзмерители",Неопределено);
	ИсточникиДанных.Вставить("НаборПоказаний",					НаборПоказаний);
		
	энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериодыПерерасчет(Организация,Район,ЧастныйСектор,Строение,Помещения,ПериодНачисленияНачало,ПериодНачисленияЗавершение,ИсточникиДанных,ДополнительныеРеквизиты);  
	
	Делегат.УстановитьНаборы(ИсточникиДанных);
	
	Инструмент.Начислить(Делегат);
	
	Набор 									= Делегат.НаборОбъемНачислений;
	Для Каждого СтрокаНабора Из Набор Цикл
		РегистрыНакопления.энргОбъемНачислений.РассчитатьСуммы(СтрокаНабора);		
	КонецЦикла;
	
	НаборПомещение 							= Делегат.НаборОбъемНачисленийПомещений;
	
КонецПроцедуры

Процедура ДанныеПерерасчетаМКД(Организация,Район,МКД,НачПерНачисления,ПериодНачисления,Набор,КорректировкаПоказаний) Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ДанныеПерерасчетаМКД(Организация, Район,МКД,НачПерНачисления,ПериодНачисления,Набор,КорректировкаПоказаний);
     	
КонецПроцедуры

Процедура ИзменитьПризнакСостояниеПрибора(Параметры) Экспорт
	
	Инструменты 						= энргФабрикаИнструментовНачисления.ИнструментыПерерасчет();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли;	
	
	Делегат 								= энргФабрикаИнструментовНачисления.ДелегатПерерасчета();
	Делегат.Организация  					= Параметры.Организация;
	Делегат.Район							= Параметры.Район;
	Делегат.ЧастныйСектор 					= Параметры.ЧастныйСектор;
	Если Не Параметры.ЧастныйСектор = Неопределено Тогда
		Делегат.Строение					= Параметры.Строение;
	КонецЕсли;
	Делегат.мПомещения						= Параметры.Помещение;
	Делегат.ПериодНачисленияНачало			= НачалоГода(Параметры.ПериодНачисления);
	Делегат.ПериодНачисленияЗавершение		= ДобавитьМесяц(Параметры.ПериодНачисления, -1);
	Делегат.ПериодНачисления				= Параметры.ПериодНачисления;
	Делегат.ВидОперацийНачисления 			= Перечисления.энргВидыОперацийНачисления.ПерерасчетИзменениеПризнакаНаличияПрибораУчетаСНачалаГода;
	Делегат.ПроверятьДатуЗапретаИзменения	= Ложь;

	Инструменты.ИзменитьПризнакСостояниеПрибора(Делегат);
	
КонецПроцедуры

Процедура ПересчитатьРаспредениеОбъемаПотребленногоМКД() Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПересчитатьРаспредениеОбъемаПотребленногоМКД();
	
КонецПроцедуры

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура НачислитьПомещенияСРазделеннымиЛС(Организация, ПериодНачисления,Район,Строение = Неопределено,Помещение = Неопределено,Документ  = Неопределено) Экспорт
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	Инструменты.НачислитьПомещенияСРазделеннымиЛС(Организация, ПериодНачисления,Район,Строение,Помещение,Документ);
	
КонецПроцедуры

Процедура РаспределениеОбъемаПомещения(Организация, ПериодНачисления, Район,Строение = Неопределено,Помещение = Неопределено, Документ = Неопределено)  Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыНачислений();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.РаспределениеОбъемаПомещения(Организация, ПериодНачисления, Район, Строение, Помещение, Документ);

КонецПроцедуры

Процедура СкорректироватьПотреблениеСезонныхУслуг(Параметры, Набор = Неопределено, НаборОбъемПомещений = Неопределено) Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыПерерасчет();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	
	Инструменты.СкорректироватьПотреблениеСезонныхУслуг(Параметры.Организация, Параметры.ПериодНачисления,Параметры.Район,Параметры.Строение,Параметры.Помещение,Набор,НаборОбъемПомещений);
	
КонецПроцедуры

Процедура СкорректироватьПотреблениеСезонныхУслугМКД(Параметры, Набор = Неопределено) Экспорт 
	
	Инструменты = энргФабрикаИнструментовНачисления.ИнструментыПерерасчет();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	
	Инструменты.СкорректироватьПотреблениеСезонныхУслугМКД(Параметры.Организация,Параметры.ПериодНачисления,Параметры.Район,Параметры.Строение,Набор);
	
КонецПроцедуры

Процедура ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, Набор, НаборВыполненные, НаборОбъемПомещений, Ошибки) Экспорт 
	
	Попытка
		Если НЕ ДокументОбъект = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
			ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;														
		
		Если НЕ НаборВыполненные = Неопределено Тогда
			НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
		КонецЕсли;
										
		Набор.Записать(Ложь);								
		НаборОбъемПомещений.Записать(Ложь);						
		
		ЗафиксироватьТранзакцию();
	Исключение						
		ОтменитьТранзакцию();
		ИнформацияОбОшибке  					= ИнформацияОбОшибке();
		Ошибки 									= Ошибки +
		Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;

КонецПроцедуры

Процедура ПрочитатьНаборыЗаписейНачисление(Выборка, ДокументОбъект, Помещение, Набор, НаборОбъемПомещений, НаборВыполненные, ВидОперацийНачисления) Экспорт 
	
	НачатьТранзакцию();
	ДокументСсылка 									= Выборка.ДокументНачисления;
	ПометкаУдаления 								= Выборка.ДокументНачисленияПометкаУдаления;
	ДокументОбъект 									= Неопределено;
	Набор 											= Неопределено;
	НаборОбъемПомещений 							= Неопределено;
	НаборВыполненные 								= Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
		Если ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.Индивидуальные Тогда
			ДокументСсылка 							= Документы.энргНачисление.ПолучитьСсылку(Новый УникальныйИдентификатор());
			ДокументОбъект  						= Документы.энргНачисление.СоздатьДокумент();
			ДокументОбъект.МКД 						= Выборка.МКД;
		ИначеЕсли ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.КорректировкаПотребленияСезонныхУслуг Тогда
			ДокументСсылка 							= Документы.энргПерерасчет.ПолучитьСсылку(Новый УникальныйИдентификатор());
			ДокументОбъект  						= Документы.энргПерерасчет.СоздатьДокумент();
			ДокументОбъект.ВидОперации				= Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг;
			ДокументОбъект.Строение					= Выборка.МКД;
			ДокументОбъект.ПериодНачисления 		= Выборка.ПериодНачисления;
		Иначе
			ВызватьИсключение "Не указан вид операций начисления";
		КонецЕсли;
		
		ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
		
		ДокументОбъект.район  						= Выборка.Район;		
																	 
		ДокументОбъект.Дата							= Выборка.ЗавершениеОП-1;
		ДокументОбъект.Организация 					= Выборка.Организация;
				
		НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненныеДопСвойства 				= НаборВыполненные.ДополнительныеСвойства;
		НаборВыполненныеДопСвойства.Вставить("Замещать", Ложь);
		ЗаписьВыполненные							= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 				= Выборка.Организация;
		ЗаписьВыполненные.Район		 				= Выборка.Район;
		ЗаписьВыполненные.ПериодНачисления 			= Выборка.ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления		= ВидОперацийНачисления;
		ЗаписьВыполненные.МКД 						= Выборка.МКД;
		ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
		
	ИначеЕсли ПометкаУдаления Тогда
		ДокументОбъект  							= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 				= Ложь;
		ДокументОбъект.Дата							= Выборка.ЗавершениеОП-1;
		
		НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
																																									 
		НаборВыполненные.Отбор.Организация.Установить(Выборка.Организация);
		НаборВыполненные.Отбор.ПериодНачисления.Установить(Выборка.ПериодНачисления);
		НаборВыполненные.Отбор.Район.Установить(Выборка.Район);
		НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(ВидОперацийНачисления);
		НаборВыполненные.Отбор.МКД.Установить(Выборка.МКД);
		НаборВыполненныеДопСвойства 				= НаборВыполненные.ДополнительныеСвойства;
		НаборВыполненныеДопСвойства.Вставить("Замещать", Истина);
		
		ЗаписьВыполненные							= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 				= Выборка.Организация;
		ЗаписьВыполненные.Район		 				= Выборка.Район;
		ЗаписьВыполненные.ПериодНачисления 			= Выборка.ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления 	= ВидОперацийНачисления;
		ЗаписьВыполненные.МКД 						= Выборка.МКД;
		ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
		ЗаписьВыполненные.ПометкаУдаления	 		= Ложь;
	КонецЕсли;
	
	Набор 											= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Набор.ДополнительныеСвойства.Вставить("Организация",		Выборка.Организация);
	Набор.ДополнительныеСвойства.Вставить("Район",				Выборка.Район);
	Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	Выборка.ПериодНачисления);
	Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор",		Выборка.ЧастныйСектор);
	Набор.ДополнительныеСвойства.Вставить("Строение",			Выборка.МКД);
	Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	Выборка.ЗавершениеОП-1);
	
	Если Не Помещение = Неопределено Тогда					
		Набор.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
																			 
		Набор.Прочитать();		
		СтрокиУдалить 							= Новый Массив;
																																												
		Для Каждого СтрокаНабора ИЗ Набор Цикл
			Если НЕ СтрокаНабора.Помещение = Помещение Тогда
				Продолжить;
			КонецЕсли;			
			СтрокиУдалить.Добавить(СтрокаНабора);
		КонецЦикла;
		
		Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
			Набор.Удалить(СтрокиУдалить[Сч]);
		КонецЦикла; 				
	КонецЕсли;
	
	НаборОбъемПомещений								= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
	НаборОбъемПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Организация",		Выборка.Организация);
	НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Район",			Выборка.Район);
	НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ПериодНачисления",	Выборка.ПериодНачисления);
	НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ЧастныйСектор",	Выборка.ЧастныйСектор);
	НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Строение",			Выборка.МКД);
	НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ДатаРегистратора",	Выборка.ЗавершениеОП - 1);	
		
	Если Не Помещение = Неопределено Тогда					
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Помещение",	Помещение);		
																			 
		НаборОбъемПомещений.Прочитать();
		СтрокиУдалить 							= Новый Массив;
																																																				 
		Для Каждого СтрокаНабора ИЗ НаборОбъемПомещений Цикл
			Если НЕ СтрокаНабора.Помещение = Помещение Тогда
				Продолжить;
			КонецЕсли;			
			СтрокиУдалить.Добавить(СтрокаНабора);
		КонецЦикла;
		
		Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
			НаборОбъемПомещений.Удалить(СтрокиУдалить[Сч]);
		КонецЦикла; 		
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		Набор.Записать();
		НаборОбъемПомещений.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Процедура ЗаписатьНаборыЗаписей(СтруктураНаборов, Замещение = Истина) Экспорт 
	
	Ключи = Новый СписокЗначений;
	Для Каждого КлючЗначение Из СтруктураНаборов Цикл
		Ключи.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Ключи.СортироватьПоЗначению();
	
	Для Каждого СтрокаСписка Из Ключи Цикл
		Если СтруктураНаборов[СтрокаСписка.Значение].ДополнительныеСвойства.Свойство("ЗамещатьОтложенныеДвижения") Тогда
			СтруктураНаборов[СтрокаСписка.Значение].Записать(Истина);
		Иначе
			СтруктураНаборов[СтрокаСписка.Значение].Записать(Замещение);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция СформироватьСтрокуДляЗапроса(ИмяРегистра,ИмяТаблицы,ИсключаемыеПоля,ПерваяСтрока = Ложь, ПоследняяСтрока = Истина ,ЭтоГруппировка = ложь) Экспорт
	
	ОписаниеТаблицы = энргНачисления.ИзмеренияТаблицыОбъемов(ИмяРегистра); 
	
	ПоляИсключая 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключаемыеПоля,,Истина);
	ПоляИзмерений 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Измерения,,Истина);
	ПоляРесурсов	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Ресурсы,,Истина);
	
	Если ПерваяСтрока Тогда
		Сч 			= 0;
	Иначе
		Сч 			= 1;
	КонецЕсли;

	Результат  		= "";
	Для Каждого Поле Из ПоляИзмерений Цикл
		Если НЕ ПоляИсключая.Найти(Поле) = Неопределено ИЛИ Лев(ВРЕГ(Поле),7) = "УДАЛИТЬ" Тогда
			Продолжить;
		КонецЕсли;
		Результат 	= Результат + ?(Сч > 0, Символы.ПС,"") + ИмяТаблицы + "." + Поле + ?(Не ЭтоГруппировка, " КАК " + Поле + ",", ","); 
		Сч 			= Сч + 1;		
	КонецЦикла;	
	
	Для Каждого Поле Из ПоляРесурсов Цикл
		Если НЕ ПоляИсключая.Найти(Поле) = Неопределено ИЛИ Лев(ВРЕГ(Поле),7) = "УДАЛИТЬ" Тогда
			Продолжить;
		КонецЕсли;
		Результат 	= Результат + ?(Сч > 0, Символы.ПС,"") + ИмяТаблицы + "." + Поле + ?(Не ЭтоГруппировка, " КАК " + Поле + ",", ","); 
		Сч 			= Сч + 1;		
	КонецЦикла;
	
	Если ПоследняяСтрока Тогда
		Результат 	= Лев(Результат, СтрДлина(Результат) - 1);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ОписаниеДокументаНачисления(ИмяДокумента) Экспорт 
	Описание 			= Новый Структура;
	
	МетаданныеДокумета  = Метаданные.Документы[ИмяДокумента];
	
	для Каждого Реквизит из МетаданныеДокумета.Реквизиты цикл
		Описание.Вставить(Реквизит.имя);
	КонецЦикла;
	
	Описание.Вставить("ОбъемНачислений", ПолучитьСтруктуруРегистраНакоплений(Метаданные.РегистрыНакопления.энргОбъемНачислений));
	Описание.Вставить("ОбъемПомещений",  ПолучитьСтруктуруРегистраНакоплений(Метаданные.РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС));
	
	Возврат Описание;	
КонецФункции

Функция ПолучитьСтруктуруРегистраНакоплений(Знач МетаРН)
	
	Перем РеквизитТЧ;
	
	ТаблицаТЧ = Новый ТаблицаЗначений;
	
	Для Каждого РеквизитТЧ из МетаРН.Измерения цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);		
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из МетаРН.Ресурсы цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из МетаРН.Реквизиты цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	ТаблицаТЧ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));

	Возврат ТаблицаТЧ;
КонецФункции

Функция ОписаниеТаблицыОбъемов(ИмяРегистра = "энргОбъемНачислений") Экспорт 		
		
	ТаблицаТЧ 			= Новый ТаблицаЗначений;
	
	ОбъектМетаданных 	= Метаданные.РегистрыНакопления.Найти(ИмяРегистра);
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.РегистрыСведений.Найти(ИмяРегистра);		
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат ТаблицаТЧ;
	КонецЕсли;
		
	Для Каждого РеквизитТЧ из ОбъектМетаданных.Измерения цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);		
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из ОбъектМетаданных.Ресурсы цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из ОбъектМетаданных.Реквизиты цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Возврат ТаблицаТЧ;	

КонецФункции

Функция ИзмеренияТаблицыОбъемов(ИмяРегистра = "энргОбъемНачислений") Экспорт		
	Возврат энргНачисленияПовтИсп.ИзмеренияТаблицыОбъемов(ИмяРегистра);		
КонецФункции

Функция ОпределитьНачальныйПериодПерерасчета(Организация,Район,ДокументыОснования,Корректировка=Ложь) Экспорт
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргВводНачальныхОстатков"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргОбходнойЛист"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПриходныйКассовыйОрдер"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПерерасчет"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента"));
	
	
	Текст  							="ВЫБРАТЬ МАКСИМУМ(ВложенныйЗапрос.ДатаФакт)КАК ДатаФакт  ИЗ (Выбрать Минимум(ВложенныйЗапрос.ДатаФактическогоСобытия) КАК ДатаФакт ИЗ (%%ТекстВложенногоЗапроса%%) КАК ВложенныйЗапрос ОБЪЕДИНИТЬ ВСЕ " +Символы.ПС + " ВЫБРАТЬ энргДатаНачалаВеденияУчета.Значение  ИЗ Константа.энргДатаНачалаВеденияУчета КАК энргДатаНачалаВеденияУчета ГДЕ энргДатаНачалаВеденияУчета.Значение > ДАТАВРЕМЯ(1, 1, 1)) КАК ВложенныйЗапрос";
	ТекстВложенногоЗапроса 			="";
	Шаблон 							="ВЫБРАТЬ Док.ДатаФактическогоСобытия ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	ШаблонИсключения 				="ВЫБРАТЬ Док.Дата ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	
	ВозможныеТипы 					= Метаданные.Документы.энргПерерасчет.ТабличныеЧасти.ДокументыОснования.Реквизиты.Документ.Тип.типы();
	ГлавСчетчик 					= 0; 
	для Каждого Тип из ВозможныеТипы цикл
		
		Если не Корректировка и Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда // не корректировка и нет дата факт
			Продолжить;
		КонецЕсли;
		
		МетадДок 					= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  					= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
			ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;
		
		Если Корректировка и Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда   // корректировка и нет дата факт
			
			ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + СтрЗаменить(ШаблонИсключения,"%%ИмяДокумента%%",ИмяДок);
			
		Иначе   // есть дата факт
			
			ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + СтрЗаменить(Шаблон,"%%ИмяДокумента%%",ИмяДок);
			
		КонецЕсли;
		
		ГлавСчетчик 			= ГлавСчетчик + 1;
	КонецЦикла;
	
	// ТекстВложенногоЗапроса 			= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ " +Символы.ПС + " ВЫБРАТЬ энргДатаНачалаВеденияУчета.Значение  ИЗ Константа.энргДатаНачалаВеденияУчета КАК энргДатаНачалаВеденияУчета ГДЕ энргДатаНачалаВеденияУчета.Значение > ДАТАВРЕМЯ(1, 1, 1)";
	
	Текст 							= СтрЗаменить(Текст,"%%ТекстВложенногоЗапроса%%",ТекстВложенногоЗапроса);
	Запрос 							= Новый Запрос;
	Запрос.Текст 					=Текст;
	Запрос.УстановитьПараметр("МассивСсылок",ДокументыОснования);
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Выборка.ДатаФакт, Организация, Район);	
	
КонецФункции

#КонецОбласти 

#Область ФоновоеНачисление
Процедура энргВыполнениеНачислений() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции

Функция ТипыРасходовВФормулахРасчета() Экспорт 
	Возврат энргНачисленияПовтИсп.ТипыРасходовВФормулахРасчета();
КонецФункции

Функция ТекстГраницОтчетногоПериода(НачПерНач,КонПерНач,УчитыватьНачалоВеденияУчета = ложь) Экспорт 
	Нач				= НачПерНач; 	
	
	Шаблон 			=
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, ВЫБОР
	|				КОГДА энргДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|					ТОГДА ДЕНЬ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), СЕКУНДА, -1))
	|				ИНАЧЕ энргДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|			КОНЕЦ)) КАК НачалоОП,
	|	ДОБАВИТЬКДАТЕ(&ПериодНачисления, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, ВЫБОР
	|				КОГДА энргДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|					ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ))
	|				ИНАЧЕ энргДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|			КОНЕЦ)) КАК ЗавершениеОП,
	|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, ВЫБОР
	|					КОГДА энргДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|						ТОГДА ДЕНЬ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), СЕКУНДА, -1))
	|					ИНАЧЕ энргДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|				КОНЕЦ)), ДОБАВИТЬКДАТЕ(&ПериодНачисления, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, ВЫБОР
	|					КОГДА энргДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|						ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ))
	|					ИНАЧЕ энргДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|				КОНЕЦ)), ДЕНЬ) КАК ДнейВПериоде
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗавершениеПредыдущего.Период КАК ЗавершениеПредыдущего,
	|		ЗавершениеТекущего.Период КАК ЗавершениеТекущего
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргДатыОтчетногоПериоды.Завершение КАК Период
	|		ИЗ
	|			РегистрСведений.энргДатыОтчетногоПериоды КАК энргДатыОтчетногоПериоды
	|		ГДЕ
	|			энргДатыОтчетногоПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргДатыОтчетногоПериоды.Организация = &Организация) КАК ЗавершениеТекущего
	|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				энргДатыОтчетногоПериоды.Завершение КАК Период
	|			ИЗ
	|				РегистрСведений.энргДатыОтчетногоПериоды КАК энргДатыОтчетногоПериоды
	|			ГДЕ
	|				энргДатыОтчетногоПериоды.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|				И энргДатыОтчетногоПериоды.Организация = &Организация) КАК ЗавершениеПредыдущего
	|			ПО (ИСТИНА)) КАК ВложенныйЗапрос
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			энргДатыОтчетногоПериодыОбщиеНастройки.Завершение КАК Завершение
	|		ИЗ
	|			РегистрСведений.энргДатыОтчетногоПериодыОбщиеНастройки КАК энргДатыОтчетногоПериодыОбщиеНастройки
	|		ГДЕ
	|			энргДатыОтчетногоПериодыОбщиеНастройки.Организация = &Организация) КАК энргДатыОтчетногоПериодыОбщиеНастройки
	|		ПО (ИСТИНА)";
	Текст 				= "";
	Сч					= 0;
	Пока Истина цикл
		Если  Нач >КонПерНач тогда
			Прервать;;
		КонецЕсли;
		СтрокаПериода 		= "ДАТАВРЕМЯ(" +СтрЗаменить(СтрЗаменить(Год(Нач)," ",""),Символы.НПП,"") + "," + СтрЗаменить(СтрЗаменить(МЕСЯЦ(Нач)," ",""),Символы.НПП,"") + "," +  СтрЗаменить(СтрЗаменить(ДЕНЬ(Нач)," ",""),Символы.НПП,"") + ")";
		
		Если Сч> 0 тогда
			Текст 			= Текст + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" +Символы.ПС; 						
		КонецЕсли;
		
		Текст 				= Текст + СтрЗаменить(Шаблон,"&ПериодНачисления",СтрокаПериода);
		Если Сч = 0 тогда
			Текст 			= СтрЗаменить(Текст,"%%ФормируемВременную%%","ПОМЕСТИТЬ ГраницыОтчетногоПериода");
		иначе 
			Текст 			= СтрЗаменить(Текст,"%%ФормируемВременную%%",""); 						
		КонецЕсли;		
		Сч 					= Сч + 1;
		Нач 				= ДобавитьМесяц(Нач,1);
	КонецЦикла;
	
	Если УчитыватьНачалоВеденияУчета тогда
		НачалоВеденияУчета 	= энргОбщегоНазначения.ЗначениеКонстанты("энргДатаНачалаВеденияУчета");
		Если ЗначениеЗаполнено(НачалоВеденияУчета) тогда
			Год 			= СтрЗаменить(Год(НачалоВеденияУчета),Символы.НПП,"");
			Месяц 			= СтрЗаменить(Месяц(НачалоВеденияУчета),Символы.НПП,"");
			День 			= СтрЗаменить(День(НачалоВеденияУчета),Символы.НПП,"");
			СтрокаЗапроса  	= "ДАТАВРЕМЯ(" + Год + "," + Месяц + "," + День + ")";
			СтрокаПоиска	= "" +СтрокаЗапроса +" КАК ПериодНачисления,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(" + СтрокаЗапроса + ", СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, энргДатыОтчетногоПериодыОбщиеНастройки.Завершение)) КАК НачалоОП,
			|	ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, энргДатыОтчетногоПериодыОбщиеНастройки.Завершение)) КАК ЗавершениеОП,
			|	РазностьДат(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, энргДатыОтчетногоПериодыОбщиеНастройки.Завершение)),ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, энргДатыОтчетногоПериодыОбщиеНастройки.Завершение)), СЕКУНДА, -1),День)+1  КАК ДнейВПериоде";
			
			СтрокаЗамены 	= "" + СтрокаЗапроса +" КАК ПериодНачисления,
			|	" + СтрокаЗапроса +" КАК НачалоОП,
			|	ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, энргДатыОтчетногоПериодыОбщиеНастройки.Завершение)) как ЗавершениеОП,
			|	РазностьДат(" + СтрокаЗапроса +",ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, энргДатыОтчетногоПериодыОбщиеНастройки.Завершение)),ДЕНЬ)  КАК ДнейВПериоде";
			
			Текст 			= СтрЗаменить(Текст,СтрокаПоиска,СтрокаЗамены);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ГраницыОтчетногоПериода(Организация,Район,ПериодНачисления) Экспорт 
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	= ТекстГраницОтчетногоПериода(ПериодНачисления,ПериодНачисления,Истина);
	результат 		= Запрос.Выполнить();
	Выборка  		= результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка;
КонецФункции

Процедура КорректировкаЗадолженностиПриИзмененииМКД(СтарыйМКД, НовыйМКД, Период, СтруктураРегистров) Экспорт
	
	ВидРН_Остатки = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;
	
	ОписаниеТипов_Строение = Новый ОписаниеТипов("СправочникСсылка.энргСтроения");
	Тип_Число = Тип("Число");
	
	Для каждого СтрокаСтруктуры Из СтруктураРегистров Цикл
			
		ТекущийОбъектМетаданных = Метаданные.РегистрыНакопления[СтрокаСтруктуры.Ключ];		
		Если НЕ ТекущийОбъектМетаданных.ВидРегистра = ВидРН_Остатки Тогда
			Продолжить;
		КонецЕсли;
	
		ИзмерениеОтбора = "";		
		Для Каждого ТекущееИзмерение из ТекущийОбъектМетаданных.Измерения Цикл
			Если ТекущееИзмерение.Тип = ОписаниеТипов_Строение Тогда
				ИзмерениеОтбора = ТекущееИзмерение.Имя;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ИзмерениеОтбора = "" Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = СтрокаСтруктуры.Значение;
		
		МассивРесурсов = Новый Массив;
		Для Каждого ТекущийРесурс из ТекущийОбъектМетаданных.Ресурсы Цикл
			Если Тип(ТекущийРесурс.Тип) = Тип_Число Тогда
				МассивРесурсов.Добавить(ТекущийРесурс.Имя);
			КонецЕсли;	
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрНакопления." + СтрокаСтруктуры.Ключ +  ".Остатки(&Период, &ИзмерениеОтбора = &МКД) КАК НужныйРегистр";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИзмерениеОтбора", ИзмерениеОтбора);		
		Запрос.УстановитьПараметр("МКД", СтарыйМКД);
		Запрос.УстановитьПараметр("Период", Период);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НСтр = НаборЗаписей.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
			НСтр.Период = Период;
			
			НСтр_Обр = НаборЗаписей.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(НСтр_Обр, ВыборкаДетальныеЗаписи);
			НСтр_Обр[ИзмерениеОтбора] = НовыйМКД;
			НСтр_Обр.Период = Период;
			
			Для каждого ТекущийРесурс Из МассивРесурсов Цикл
				НСтр[ТекущийРесурс] = ВыборкаДетальныеЗаписи[ТекущийРесурс + "Остаток"];
				НСтр_Обр[ТекущийРесурс] = ВыборкаДетальныеЗаписи[ТекущийРесурс + "Остаток"];
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаОплатыРеструктуризации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРеструктуризацияДолгаСрезПоследних.Организация КАК Организация,
		|	энргРеструктуризацияДолгаСрезПоследних.Район КАК Район,
		|	энргРеструктуризацияДолгаСрезПоследних.Строение КАК Строение,
		|	энргРеструктуризацияДолгаСрезПоследних.Абонент КАК Абонент,
		|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	энргРеструктуризацияДолгаСрезПоследних.Документ КАК Документ,
		|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
		|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая КАК СуммаОбщая,
		|	энргРеструктуризацияДолгаСрезПоследних.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ДанныеРеструктуризации
		|ИЗ
		|	РегистрСведений.энргРеструктуризацияДолга.СрезПоследних(&ТекущаяДата, ДатаОплаты = &ДатаОплаты) КАК энргРеструктуризацияДолгаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРеструктуризации.Организация КАК Организация,
		|	ДанныеРеструктуризации.Район КАК Район,
		|	ДанныеРеструктуризации.Строение КАК Строение,
		|	ДанныеРеструктуризации.Абонент КАК Абонент,
		|	энргДокументыРеструктуризации.Услуга КАК Услуга,
		|	энргДокументыРеструктуризации.ПериодНачисления КАК ПериодНачисления,
		|	энргДокументыРеструктуризации.Поставщик КАК Поставщик,
		|	ДанныеРеструктуризации.ДатаОплаты КАК ДатаОплаты,
		|	ДанныеРеструктуризации.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
		|	ДанныеРеструктуризации.СуммаОбщая КАК СуммаОбщая,
		|	ДанныеРеструктуризации.ДатаНачала КАК ДатаНачала,
		|	ДанныеРеструктуризации.Документ КАК Документ,
		|	энргДокументыРеструктуризации.Сумма КАК Сумма
		|ПОМЕСТИТЬ ПериодыРасчета
		|ИЗ
		|	ДанныеРеструктуризации КАК ДанныеРеструктуризации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДокументыРеструктуризации КАК энргДокументыРеструктуризации
		|		ПО ДанныеРеструктуризации.Документ = энргДокументыРеструктуризации.ДокументРеструктуризации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыРасчета.Организация КАК Организация,
		|	ПериодыРасчета.Район КАК Район,
		|	ПериодыРасчета.Строение КАК Строение,
		|	ПериодыРасчета.Абонент КАК Абонент,
		|	ПериодыРасчета.Услуга КАК Услуга,
		|	ПериодыРасчета.ПериодНачисления КАК ПериодНачисления,
		|	ПериодыРасчета.Поставщик КАК Поставщик,
		|	ПериодыРасчета.ДатаОплаты КАК ДатаОплаты,
		|	ПериодыРасчета.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
		|	ПериодыРасчета.СуммаОбщая КАК СуммаОбщая,
		|	ПериодыРасчета.ДатаНачала КАК ДатаНачала,
		|	ПериодыРасчета.Документ КАК Документ,
		|	ЕСТЬNULL(энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиРасход, 0) КАК Сумма,
		|	ПериодыРасчета.Сумма - ЕСТЬNULL(энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиРасход, 0) КАК Остаток
		|ПОМЕСТИТЬ ФактическиеСуммы
		|ИЗ
		|	ПериодыРасчета КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргЗабалансоваяЗадолженность.Обороты(
		|				,
		|				&ТекущаяДата,
		|				День,
		|				(Организация, Район, МКД, Абонент, Услуга, ПериодНачисления, Поставщик) В
		|						(ВЫБРАТЬ
		|							ПериодыРасчета.Организация КАК Организация,
		|							ПериодыРасчета.Район КАК Район,
		|							ПериодыРасчета.Строение КАК Строение,
		|							ПериодыРасчета.Абонент КАК Абонент,
		|							ПериодыРасчета.Услуга КАК Услуга,
		|							ПериодыРасчета.ПериодНачисления КАК ПериодНачисления,
		|							ПериодыРасчета.Поставщик КАК Поставщик
		|						ИЗ
		|							ПериодыРасчета КАК ПериодыРасчета)
		|					И ВидЗадолженности = &ВидЗадолженности) КАК энргЗабалансоваяЗадолженностьОбороты
		|		ПО ПериодыРасчета.Организация = энргЗабалансоваяЗадолженностьОбороты.Организация
		|			И ПериодыРасчета.Район = энргЗабалансоваяЗадолженностьОбороты.Район
		|			И ПериодыРасчета.Строение = энргЗабалансоваяЗадолженностьОбороты.МКД
		|			И ПериодыРасчета.Абонент = энргЗабалансоваяЗадолженностьОбороты.Абонент
		|			И ПериодыРасчета.Услуга = энргЗабалансоваяЗадолженностьОбороты.Услуга
		|			И ПериодыРасчета.ПериодНачисления = энргЗабалансоваяЗадолженностьОбороты.ПериодНачисления
		|			И ПериодыРасчета.Поставщик = энргЗабалансоваяЗадолженностьОбороты.Поставщик
		|			И ПериодыРасчета.ДатаНачала <= энргЗабалансоваяЗадолженностьОбороты.Период
		|			И ПериодыРасчета.ДатаОплаты >= энргЗабалансоваяЗадолженностьОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеСуммы.Документ КАК Документ,
		|	ФактическиеСуммы.ДатаОплаты КАК ДатаОплаты,
		|	ФактическиеСуммы.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
		|	СУММА(ФактическиеСуммы.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ОплатыПоДокументам
		|ИЗ
		|	ФактическиеСуммы КАК ФактическиеСуммы
		|
		|СГРУППИРОВАТЬ ПО
		|	ФактическиеСуммы.Документ,
		|	ФактическиеСуммы.ДатаОплаты,
		|	ФактическиеСуммы.СуммаНарастающимИтогом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыПоДокументам.Документ КАК Документ,
		|	МИНИМУМ(ОплатыПоДокументам.Сумма >= ОплатыПоДокументам.СуммаНарастающимИтогом) КАК Отметка
		|ПОМЕСТИТЬ ОплаченныеДокументы
		|ИЗ
		|	ОплатыПоДокументам КАК ОплатыПоДокументам
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатыПоДокументам.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеСуммы.Организация КАК Организация,
		|	ФактическиеСуммы.Район КАК Район,
		|	ФактическиеСуммы.ПериодНачисления КАК ПериодНачисления,
		|	ФактическиеСуммы.Строение КАК Строение,
		|	ФактическиеСуммы.Абонент КАК Абонент,
		|	ФактическиеСуммы.Услуга КАК Услуга,
		|	ФактическиеСуммы.Поставщик КАК Поставщик,
		|	ФактическиеСуммы.Остаток КАК Остаток
		|ИЗ
		|	ОплаченныеДокументы КАК ОплаченныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФактическиеСуммы КАК ФактическиеСуммы
		|		ПО ОплаченныеДокументы.Документ = ФактическиеСуммы.Документ
		|			И (НЕ ОплаченныеДокументы.Отметка)
		|ГДЕ
		|	ФактическиеСуммы.Остаток > 0
		|ИТОГИ
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Район),
		|	МАКСИМУМ(Строение)
		|ПО
		|	Абонент";
	
	Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
	ТекущаяДата = НачалоДня(ТекущаяДата());	
	ВидОперации = Перечисления.энргВидыОперацийНачисления.ЗакрытиеРеструктуризацииДолга;
	
	Запрос.УстановитьПараметр("ВидЗадолженности", Перечисления.энргВидыЗадолженности.РеструктуризированнаяЗадолженность);
	Запрос.УстановитьПараметр("ДатаОплаты", ТекущаяДата - 1);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАбонент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАбонент.Следующий() Цикл
		
		НДок = Документы.энргСоглашениеПоРассрочке.СоздатьДокумент();
		НДок.Дата = ТекущаяДата;
		НДок.Абонент = ВыборкаАбонент.Абонент;
		НДок.ВидОперации = ВидОперации;
		НДок.Организация = ВыборкаАбонент.Организация;
		НДок.Ответственный = Ответственный;
		НДок.Район = ВыборкаАбонент.Район;
		НДок.Строение = ВыборкаАбонент.Строение;
	
		ВыборкаДетальныеЗаписи = ВыборкаАбонент.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НСтр = НДок.ТекущиеЗадолженности.Добавить();
			НСтр.ПериодНачисления = ВыборкаДетальныеЗаписи.ПериодНачисления;
			НСтр.Услуга = ВыборкаДетальныеЗаписи.Услуга;
			НСтр.Сумма = ВыборкаДетальныеЗаписи.Остаток;
			НСтр.Поставщик = ВыборкаДетальныеЗаписи.Поставщик;
		КонецЦикла;
		
		НДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
